{
	"pluginmetadataversion" : 2,
	"name": "Auto Utils",
	"type": ["helper"],
	"api": ["python3"],
	"description": "Various auto analysis utilities",
	"longdescription": "# Binary Ninja Auto Utils\nAuto Utils provides various helpers for automatically discovering features about a binary.\n\nSome examples:\n\n * Renaming of methods based on logging with method names\n * That's it right now, sorry\n\n## Examples\n\n### Automatic symbol name discovery based on call args\nIn cases where you for example have a common logging function that will log the\ncaller's name using an argument passed to it, the plugin will be able to rename\nthe names of all callers based on the strings left in the binary.\n\nGiven an example binary with methods as shown below:\n\n![Subroutines without clear or meaningful names](https://raw.githubusercontent.com/404d/autoutils/master/extras/discover_arg_before.png)\n\nBy running the \"Analysis → Discover caller names by call parameters\" action\nwhile being inside the `log_msg` subroutine and providing it with the parameter\nname `arg1`, the plugin will change the name of all callers to `log_msg` as such:\n\n![Subroutines after call-argument name discovery](https://raw.githubusercontent.com/404d/autoutils/master/extras/discover_arg_after.png)\n",
	"license": {
		"name": "MIT",
		"text": "Copyright (c) 2020 Simen Lybekk\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	},
	"platforms" : ["Darwin", "Linux", "Windows"],
	"installinstructions" : {
		"Darwin" : "Install the plugin using the plugin manager or clone the repository to your plugins folder.",
		"Linux" : "Install the plugin using the plugin manager or clone the repository to your plugins folder.",
		"Windows" : "Install the plugin using the plugin manager or clone the repository to your plugins folder."
	},
	"dependencies": {},
	"version": "0.2",
	"author": "404'd",
	"minimumbinaryninjaversion": 2096
}
